particle-iot/device-os/hal/src/rtl872x/spi_hal.cpp
        return 0;
    }

    int transferDma(const uint8_t* txBuf, uint8_t* rxBuf, size_t size, hal_spi_dma_user_callback callback) {
        CHECK_TRUE((txBuf || rxBuf) && size > 0, SYSTEM_ERROR_INVALID_ARGUMENT);
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);

        // Wait for last SPI master transfer finished
        while ((config_.spiMode == SPI_MODE_MASTER) && isBusy()) {
            ;
        }

        // Reset SPI in case the data in the buffer is not read completely in the last transfer
        transferDmaCancel();

        transferConfig_.reset();

        // Hardware DMA peripheral limit of 4095
        size_t blockSize = findDmaBlockSize(size);
        if (blockSize == 0) {
            return SYSTEM_ERROR_OUT_OF_RANGE;
        }
        size_t blockCount = size / blockSize;
        if (blockCount > 0xfff) {
            return SYSTEM_ERROR_TOO_LARGE;
        }
        size_t remainder = size - (blockCount * blockSize);

        if (remainder != 0 && config_.spiMode == SPI_MODE_SLAVE) {
            // XXX: for SPI slave mode only allowing transfers up to 4095 or sizes
            // which are divisible by some common block size e.g. 10000 which can be done
            // as (4 x 2500)
            // We could probably use block chaining, but it's not well documented
            return SYSTEM_ERROR_OUT_OF_RANGE;
        }

        transferConfig_.rxBuf = rxBuf;
        transferConfig_.txBuf = txBuf;
        transferConfig_.blockSize = blockSize;
        transferConfig_.blockCount = blockCount;
        transferConfig_.remainder = remainder;

        callbackConfig_.dmaUserCb = callback;
        status_.configuredTransferLength = size;
        status_.transferredLength = 0;
        
        if (txBuf) {
            DCache_CleanInvalidate((u32)txBuf, size);
        }
        if (rxBuf) {
            // This is required to make sure that software writes into rx buffer
            // are finalized, otherwise after DMA completes Invalidate may result
            // in garbage data in rxBuf.
            DCache_CleanInvalidate((u32)rxBuf, size);
        }

        return startDma();
    }

    int transferDmaCancel() {
        /* Clear Pending ISR */
        GDMA_ChCleanAutoReload(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_ChCleanAutoReload(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, DISABLE);
        GDMA_Cmd(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, DISABLE);
        GDMA_ClearINT(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        GDMA_ClearINT(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);

        status_.transmitting = false;
        status_.receiving = false;
        callbackConfig_.dmaUserCb = nullptr;

        flushRxFifo();

        return SYSTEM_ERROR_NONE;
    }

    void flushRxFifo() {
        // Flush fifo
        while (SSI_Readable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx)) {
            u32 rxFifoLevel = SSI_GetRxCount(SPI_DEV_TABLE[rtlSpiIndex_].SPIx);
            for (u32 i = 0; i < rxFifoLevel; i++) {
                uint8_t c = SSI_ReadData(SPI_DEV_TABLE[rtlSpiIndex_].SPIx);
                if (config_.spiMode == SPI_MODE_SLAVE && transferConfig_.rxBuf && status_.transferredLength < status_.configuredTransferLength) {
                    transferConfig_.rxBuf[status_.transferredLength++] = c;
                }
            }
        }
    }

    SpiConfig config() const {
        return config_;
    }

    SpiStatus status() const {
        return status_;
    }

    uint32_t getSpiInputClock() const {
        return spiInputClock_;
    }

    hal_pin_t csPin() const {
        return csPin_;
    }

    bool isEnabled() const {
        return status_.state == HAL_SPI_STATE_ENABLED;
    }

    bool isBusy() const {
        return status_.transmitting || status_.receiving;
    }

    bool isSuspended() const {
        return status_.state == HAL_SPI_STATE_SUSPENDED;
    }

    bool isDmaBufferConfigured() const {
        // Use at least one buffer for SPI transfer
        return transferConfig_.txBuf || transferConfig_.rxBuf;
    }

    int registerSelectUserCb(hal_spi_select_user_callback callback) {
        callbackConfig_.selectUserCb = callback;
        return SYSTEM_ERROR_NONE;
    }

    void interruptHandlerImpl() {
        u32 interruptStatus = SSI_GetIsr(SPI_DEV_TABLE[rtlSpiIndex_].SPIx);
        SSI_SetIsrClean(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, interruptStatus);

        if (interruptStatus & (BIT_ISR_TXOIS | BIT_ISR_RXUIS | BIT_ISR_RXOIS | BIT_ISR_MSTIS)) {
            LOG_DEBUG(WARN, "SPI error 0x%08x", interruptStatus);
        }
    }

    void dmaTxHandlerImpl(bool forceStop = false) {
        bool doneWithBlocks = forceStop;
        txDmaInitStruct_.MuliBlockCunt++;

        // IMPORTANT: needs to be caught here before any of the GDMA calls are done
        uint32_t p = GDMA_GetSrcAddr(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);

        if (!txDmaInitStruct_.MaxMuliBlock || txDmaInitStruct_.MuliBlockCunt == txDmaInitStruct_.MaxMuliBlock) {
            GDMA_ChCleanAutoReload(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
            GDMA_Cmd(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, DISABLE);
            doneWithBlocks = true;
        } else if (txDmaInitStruct_.MaxMuliBlock && txDmaInitStruct_.MuliBlockCunt == txDmaInitStruct_.MaxMuliBlock - 1) {
            GDMA_ChCleanAutoReload(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        }

        // Clear Pending ISR, free TX DMA resource
        uint32_t isrTypeMap = GDMA_ClearINT(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);
        (void)isrTypeMap;
        if (doneWithBlocks) {
            SSI_SetDmaEnable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, DISABLE, BIT_SHIFT_DMACR_TDMAE);
            status_.transmitting = false;
        }

        if (doneWithBlocks && !transferConfig_.rxBuf) {
            if (transferConfig_.txBuf) {
                status_.transferredLength += p - txDmaInitStruct_.GDMA_SrcAddr;
            } else {
                // Dummy 0xff transfer
                status_.transferredLength = status_.configuredTransferLength;
            }
            if (status_.transferredLength < status_.configuredTransferLength && transferConfig_.remainder) {
                startDma();
                return;
            }
            flushRxFifo();
            if (callbackConfig_.dmaUserCb) {
                (*callbackConfig_.dmaUserCb)();
            }
            status_.userDmaCbHandled = true;
        }
    }

